reports/333-haskell.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 1.484ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.483ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.149ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.61ms    2.06ms  61.47ms   97.81%
    Req/Sec     3.54k     1.99k   17.00k    76.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.43ms
 75.000%    1.96ms
 90.000%    2.51ms
 99.000%    4.53ms
 99.900%   43.94ms
 99.990%   57.41ms
 99.999%   60.19ms
100.000%   61.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.087     0.000000            1         1.00
       0.576     0.100000        49490         1.11
       0.812     0.200000        98951         1.25
       1.021     0.300000       148395         1.43
       1.227     0.400000       197884         1.67
       1.428     0.500000       247459         2.00
       1.527     0.550000       272133         2.22
       1.627     0.600000       296859         2.50
       1.729     0.650000       321452         2.86
       1.838     0.700000       346132         3.33
       1.957     0.750000       370983         4.00
       2.021     0.775000       383303         4.44
       2.091     0.800000       395624         5.00
       2.169     0.825000       407968         5.71
       2.259     0.850000       420273         6.67
       2.369     0.875000       432789         8.00
       2.433     0.887500       438964         8.89
       2.507     0.900000       445123        10.00
       2.589     0.912500       451178        11.43
       2.693     0.925000       457361        13.33
       2.823     0.937500       463568        16.00
       2.897     0.943750       466684        17.78
       2.983     0.950000       469726        20.00
       3.081     0.956250       472832        22.86
       3.201     0.962500       475938        26.67
       3.347     0.968750       478986        32.00
       3.437     0.971875       480568        35.56
       3.537     0.975000       482078        40.00
       3.671     0.978125       483637        45.71
       3.831     0.981250       485175        53.33
       4.025     0.984375       486717        64.00
       4.143     0.985938       487514        71.11
       4.263     0.987500       488265        80.00
       4.419     0.989062       489041        91.43
       4.623     0.990625       489808       106.67
       4.891     0.992188       490582       128.00
       5.055     0.992969       490965       142.22
       5.255     0.993750       491357       160.00
       5.491     0.994531       491739       182.86
       5.827     0.995313       492126       213.33
       6.379     0.996094       492506       256.00
       6.847     0.996484       492698       284.44
      10.591     0.996875       492891       320.00
      16.383     0.997266       493085       365.71
      19.343     0.997656       493279       426.67
      21.519     0.998047       493471       512.00
      23.599     0.998242       493567       568.89
      28.607     0.998437       493664       640.00
      35.135     0.998633       493762       731.43
      40.959     0.998828       493858       853.33
      44.255     0.999023       493954      1024.00
      45.119     0.999121       494003      1137.78
      45.727     0.999219       494052      1280.00
      46.303     0.999316       494099      1462.86
      46.815     0.999414       494154      1706.67
      47.359     0.999512       494195      2048.00
      47.935     0.999561       494220      2275.56
      48.671     0.999609       494243      2560.00
      49.983     0.999658       494268      2925.71
      51.423     0.999707       494292      3413.33
      52.735     0.999756       494316      4096.00
      53.631     0.999780       494328      4551.11
      54.239     0.999805       494340      5120.00
      55.327     0.999829       494352      5851.43
      55.999     0.999854       494364      6826.67
      56.767     0.999878       494376      8192.00
      57.055     0.999890       494383      9102.22
      57.439     0.999902       494388     10240.00
      58.143     0.999915       494394     11702.86
      58.623     0.999927       494402     13653.33
      58.911     0.999939       494406     16384.00
      59.103     0.999945       494409     18204.44
      59.327     0.999951       494412     20480.00
      59.519     0.999957       494415     23405.71
      59.711     0.999963       494418     27306.67
      59.807     0.999969       494422     32768.00
      59.871     0.999973       494423     36408.89
      59.903     0.999976       494424     40960.00
      59.935     0.999979       494426     46811.43
      59.999     0.999982       494427     54613.33
      60.095     0.999985       494429     65536.00
      60.127     0.999986       494430     72817.78
      60.127     0.999988       494430     81920.00
      60.191     0.999989       494431     93622.86
      60.287     0.999991       494432    109226.67
      60.479     0.999992       494433    131072.00
      60.479     0.999993       494433    145635.56
      60.479     0.999994       494433    163840.00
      60.703     0.999995       494434    187245.71
      60.703     0.999995       494434    218453.33
      60.927     0.999996       494435    262144.00
      60.927     0.999997       494435    291271.11
      60.927     0.999997       494435    327680.00
      60.927     0.999997       494435    374491.43
      60.927     0.999998       494435    436906.67
      61.503     0.999998       494436    524288.00
      61.503     1.000000       494436          inf
#[Mean    =        1.611, StdDeviation   =        2.055]
#[Max     =       61.472, Total count    =       494436]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  594923 requests in 1.00m, 67.52MB read
Requests/sec:   9912.30
Transfer/sec:      1.12MB