reports/333-haskell.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 1.400ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.405ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.400ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.66ms    5.10ms 130.37ms   99.16%
    Req/Sec     3.52k   573.92    15.89k    95.19%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.21ms
 75.000%    1.69ms
 90.000%    2.08ms
 99.000%    3.08ms
 99.900%   87.87ms
 99.990%  108.42ms
 99.999%  124.86ms
100.000%  130.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.087     0.000000            1         1.00
       0.521     0.100000        49688         1.11
       0.700     0.200000        98927         1.25
       0.867     0.300000       148580         1.43
       1.033     0.400000       197782         1.67
       1.209     0.500000       247355         2.00
       1.300     0.550000       272012         2.22
       1.394     0.600000       296790         2.50
       1.490     0.650000       321389         2.86
       1.589     0.700000       346164         3.33
       1.693     0.750000       370977         4.00
       1.747     0.775000       383237         4.44
       1.804     0.800000       395675         5.00
       1.865     0.825000       407998         5.71
       1.930     0.850000       420417         6.67
       2.000     0.875000       432652         8.00
       2.039     0.887500       438826         8.89
       2.083     0.900000       445209        10.00
       2.129     0.912500       451237        11.43
       2.183     0.925000       457518        13.33
       2.241     0.937500       463556        16.00
       2.275     0.943750       466663        17.78
       2.313     0.950000       469814        20.00
       2.355     0.956250       472821        22.86
       2.405     0.962500       475950        26.67
       2.461     0.968750       478970        32.00
       2.495     0.971875       480510        35.56
       2.537     0.975000       482106        40.00
       2.581     0.978125       483597        45.71
       2.639     0.981250       485172        53.33
       2.715     0.984375       486708        64.00
       2.767     0.985938       487462        71.11
       2.837     0.987500       488230        80.00
       2.951     0.989062       489004        91.43
       3.205     0.990625       489772       106.67
      11.215     0.992188       490545       128.00
      18.671     0.992969       490932       142.22
      26.671     0.993750       491317       160.00
      34.143     0.994531       491705       182.86
      41.055     0.995313       492092       213.33
      48.607     0.996094       492478       256.00
      52.351     0.996484       492670       284.44
      56.319     0.996875       492862       320.00
      61.023     0.997266       493056       365.71
      67.199     0.997656       493250       426.67
      72.767     0.998047       493444       512.00
      75.711     0.998242       493539       568.89
      78.271     0.998437       493636       640.00
      81.087     0.998633       493732       731.43
      84.159     0.998828       493828       853.33
      88.191     0.999023       493925      1024.00
      90.111     0.999121       493976      1137.78
      91.711     0.999219       494022      1280.00
      93.567     0.999316       494072      1462.86
      95.103     0.999414       494119      1706.67
      96.639     0.999512       494166      2048.00
      97.983     0.999561       494191      2275.56
      98.879     0.999609       494214      2560.00
     100.095     0.999658       494239      2925.71
     101.439     0.999707       494263      3413.33
     103.167     0.999756       494288      4096.00
     104.127     0.999780       494300      4551.11
     104.575     0.999805       494311      5120.00
     105.407     0.999829       494323      5851.43
     106.623     0.999854       494335      6826.67
     107.071     0.999878       494348      8192.00
     107.903     0.999890       494354      9102.22
     108.607     0.999902       494359     10240.00
     109.503     0.999915       494365     11702.86
     111.295     0.999927       494371     13653.33
     113.023     0.999939       494377     16384.00
     115.327     0.999945       494381     18204.44
     115.519     0.999951       494383     20480.00
     115.775     0.999957       494386     23405.71
     117.247     0.999963       494389     27306.67
     118.655     0.999969       494392     32768.00
     119.423     0.999973       494394     36408.89
     119.807     0.999976       494396     40960.00
     120.319     0.999979       494397     46811.43
     121.663     0.999982       494398     54613.33
     123.327     0.999985       494400     65536.00
     124.351     0.999986       494401     72817.78
     124.351     0.999988       494401     81920.00
     124.863     0.999989       494402     93622.86
     125.759     0.999991       494403    109226.67
     127.103     0.999992       494404    131072.00
     127.103     0.999993       494404    145635.56
     127.103     0.999994       494404    163840.00
     127.615     0.999995       494405    187245.71
     127.615     0.999995       494405    218453.33
     129.023     0.999996       494406    262144.00
     129.023     0.999997       494406    291271.11
     129.023     0.999997       494406    327680.00
     129.023     0.999997       494406    374491.43
     129.023     0.999998       494406    436906.67
     130.431     0.999998       494407    524288.00
     130.431     1.000000       494407          inf
#[Mean    =        1.657, StdDeviation   =        5.100]
#[Max     =      130.368, Total count    =       494407]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597357 requests in 1.00m, 67.79MB read
Requests/sec:   9955.72
Transfer/sec:      1.13MB